cfg/DataProcessors/РасчетныеЛисткиОрганизацийPlusLotus.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>РасчетныеЛисткиОрганизацийPlusLotus</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ТаблицаСотрудников</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МесяцГод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачальнаяСтрока</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонечнаяСтрока</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Письмо</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмо</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

cfg/InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле4</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле5</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле6</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле7</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле8</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле9</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле10</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>УдалитьКонтрагентДляОграниченияПравДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКонтактноеЛицоДляОграниченияПравДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cfg/Enums/СтатусыПисем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>СтатусыПисем</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Полученное</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправленное</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исходящее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сохраненное</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cfg/Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cfg/Catalogs/ВложенияЭлектронныхПисем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ВложенияЭлектронныхПисем</Name>
			<Comment>Вложения электронных писем</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Comment>Имя файла</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Хранилище</Name>
					<Comment>Хранилище</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДФайлаПочтовогоПисьма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстФайла</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cfg/DataProcessors/РасчетныеЛисткиОрганизацийPlusLotus/Forms/ФормаОтправкиПочты/Ext/Form/Module.bsl
Процедура КнопкаСформироватьНажатие(Кнопка)
	Для каждого СтрокаТабл Из ТаблицаСотрудников Цикл
		Если СтрокаТабл.Пометка и СтрокаТабл.Письмо.Пустая() Тогда
			ОбластьРЛ = ВладелецФормы.ЭлементыФормы.Результат.ПолучитьОбласть(СтрокаТабл.НачальнаяСтрока, , СтрокаТабл.КонечнаяСтрока, );
			ТабДок = Новый ТабличныйДокумент();
			ТабДок.Вывести(ОбластьРЛ);
			Письмо=СоздатьПисьмо(СтрокаТабл,ТабДок);
			СтрокаТабл.Письмо=Письмо;
		КонецЕсли; 
	КонецЦикла; 
КонецПроцедуры

Процедура ТаблицаСотрудниковВыборЗначения(Элемент, СтандартнаяОбработка, Значение)
КонецПроцедуры

Процедура ПриОткрытии()
	
КонецПроцедуры

Процедура ТаблицаСотрудниковНачальнаяСтрокаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
КонецПроцедуры

Процедура ТаблицаСотрудниковНачальнаяСтрокаНачалоВыбора(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
КонецПроцедуры

Процедура ТаблицаСотрудниковМесяцГодНачалоВыбора(Элемент, СтандартнаяОбработка)
КонецПроцедуры

Процедура ТаблицаСотрудниковПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	Если не ДанныеСтроки.Письмо.Пустая() и ДанныеСтроки.Письмо.СтатусПисьма = Перечисления.СтатусыПисем.Отправленное Тогда
		ОформлениеСтроки.ЦветТекста=WebЦвета.ТемноЗеленый;
	ИНачеЕсли не ДанныеСтроки.Письмо.Пустая() и ДанныеСтроки.Письмо.СтатусПисьма <> Перечисления.СтатусыПисем.Отправленное Тогда
		ОформлениеСтроки.ЦветФона=WebЦвета.Бежевый;
	КонецЕсли;
КонецПроцедуры

Процедура ТаблицаСотрудниковПередНачаломДобавления(Элемент, Отказ, Копирование)
	Отказ=Истина;
КонецПроцедуры

Процедура ТаблицаСотрудниковСотрудникПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура ТаблицаСотрудниковСотрудникНачалоВыбора(Элемент, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура ТаблицаСотрудниковПередНачаломИзменения(Элемент, Отказ)
	ТекСтрока=ЭлементыФормы.ТаблицаСотрудников.ТекущиеДанные;
	Если Элемент.ТекущаяКолонка.Данные="Пометка" 
		или Элемент.ТекущаяКолонка.Данные="Адрес" 
		//и Элемент.ТекущаяКолонка.Данные<>"МесяцГод" 
		или Элемент.ТекущаяКолонка.Данные="Письмо" Тогда
		Отказ=Ложь;
	//КонецЕсли; 
	ИначеЕсли Элемент.ТекущаяКолонка.Данные="МесяцГод" Тогда
		Отказ=Истина;
		ОбластьРЛ = ВладелецФормы.ЭлементыФормы.Результат.ПолучитьОбласть(ТекСтрока.НачальнаяСтрока, , ТекСтрока.КонечнаяСтрока, );
		НовыйТабДок = Новый ТабличныйДокумент();
		НовыйТабДок.Вывести(ОбластьРЛ);
		НовыйТабДок.Показать(ТекСтрока.Сотрудник.Наименование);
	//ИначеЕсли Элемент.ТекущаяКолонка.Данные="Сотрудник" Тогда
	//	Отказ=Истина;
	//	ТекСтрока.Сотрудник.ПолучитьФорму().Открыть();	
	КонецЕсли; 

КонецПроцедуры

Процедура ТаблицаСотрудниковПередУдалением(Элемент, Отказ)
	//Отказ=Истина;
КонецПроцедуры

Процедура ТаблицаСотрудниковАдресНачалоВыбора(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	ТекСтрока=ЭлементыФормы.ТаблицаСотрудников.ТекущиеДанные;
	РегистрСведенийСписок=РегистрыСведений.КонтактнаяИнформация.ПолучитьФормуСписка();
	//РегистрСведенийСписок.Отбор.Объект.ТипЗначения=ТипЗнч("СправочникСсылка.ФизическиеЛица");
	РегистрСведенийСписок.Отбор.Объект.Установить(ТекСтрока.Сотрудник.ФизЛицо);
	РегистрСведенийСписок.Отбор.Тип.Установить(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	РегистрСведенийСписок.Открыть();
	//Если ПустаяСтрока(ТекСтрока.Адрес) Тогда
	//КонецЕсли; 
	
КонецПроцедуры

Процедура ТаблицаСотрудниковАдресОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ТекСтрока=ЭлементыФормы.ТаблицаСотрудников.ТекущиеДанные;
	ТекСтрока.Адрес=ПолучитьАдресЭлектроннойПочтыИзКонтактнойИнформации(ТекСтрока.Сотрудник.ФизЛицо);
КонецПроцедуры

Процедура КоманднаяПанель1УстановитьФлажки(Кнопка)
	Для каждого СтрокаТабл Из ТаблицаСотрудников Цикл
		СтрокаТабл.Пометка=Истина;
	КонецЦикла;
КонецПроцедуры

Процедура КоманднаяПанель1СнятьФлажки(Кнопка)
	Для каждого СтрокаТабл Из ТаблицаСотрудников Цикл
		СтрокаТабл.Пометка=Ложь;
	КонецЦикла;
КонецПроцедуры

Процедура КоманднаяПанель1ИнвертироватьФлажки(Кнопка)
	Для каждого СтрокаТабл Из ТаблицаСотрудников Цикл
		СтрокаТабл.Пометка=не СтрокаТабл.Пометка;
	КонецЦикла;
КонецПроцедуры

Процедура ОсновныеДействияФормыСформироватьСписокСотрудников(Кнопка)
	ИсточникДоступныхНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(ВладелецФормы.СхемаКомпоновкиДанных);
	Если ВладелецФормы.ДанныеРасшифровки = Неопределено Тогда
		Сообщить("Сначал необходимо сформировать расчетные листки!");
		Возврат;
	Иначе	
		ОбработкаРасшифровки = Новый ОбработкаРасшифровкиКомпоновкиДанных(ВладелецФормы.ДанныеРасшифровки, Новый ИсточникДоступныхНастроекКомпоновкиДанных(ВладелецФормы.СхемаКомпоновкиДанных)); 
	КонецЕсли;	
	СформироватьТаблицуСотрудников(ТабличныйДокумент,ВладелецФормы.ДанныеРасшифровки);
	//ВладелецФормы.ДанныеРасшифровки.Элементы[11].ПолучитьПоля()[0].Значение.Физлицо
КонецПроцедуры


Процедура ОсновныеДействияФормыЧерезSMTP(Кнопка)
	Режим = РежимДиалогаВопрос.ДаНет;
	Ответ = Вопрос("Отправить помеченные письма?", Режим, 0);
	Если Ответ = КодВозвратаДиалога.Нет Тогда
	    Возврат;
	КонецЕсли;
	ЕстьПисьмаДляОтправки=Ложь;
	Письма = Новый Соответствие;
	МассивСтрок = Новый Массив;
	Для каждого СтрокаТабл Из ТаблицаСотрудников Цикл
		Если СтрокаТабл.Пометка и не СтрокаТабл.Письмо.Пустая() и СтрокаТабл.Письмо.СтатусПисьма <> Перечисления.СтатусыПисем.Отправленное Тогда
			//СтрокаТабл.Письмо.ПолучитьОбъект().ОтправитьПисьмо();
			Письма.Вставить(СтрокаТабл.Письмо, СтрокаТабл.Письмо.ПолучитьОбъект());
			МассивСтрок.Добавить(СтрокаТабл);
			Если не ЕстьПисьмаДляОтправки Тогда
				ЕстьПисьмаДляОтправки=Истина;
				УчетныеЗаписи = Новый Массив;
				УчетныеЗаписи.Добавить(СтрокаТабл.Письмо.УчетнаяЗапись);
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла; 
	Если ЕстьПисьмаДляОтправки Тогда
		УправлениеЭлектроннойПочтой.ПолучениеОтправкаПисем(глЗначениеПеременной("глСоответствиеТекстовЭлектронныхПисем"), глЗначениеПеременной("глТекущийПользователь"), УчетныеЗаписи, Письма, Истина);
		Для каждого СтрокаТабл Из МассивСтрок Цикл
			Если СтрокаТабл.Письмо.СтатусПисьма = Перечисления.СтатусыПисем.Отправленное Тогда
				СтрокаТабл.Пометка=Ложь;
			КонецЕсли; 
		КонецЦикла; 	
	Иначе
		Предупреждение("Нет писем для отправки!");
	КонецЕсли; 
КонецПроцедуры

Функция ПолучитьВложения(Письмо)
	ЗапросПоВложениям = Новый Запрос(
	"ВЫБРАТЬ
	|	ВложенияЭлектронныхПисем.Ссылка,
	|	ВложенияЭлектронныхПисем.ВерсияДанных,
	|	ВложенияЭлектронныхПисем.ПометкаУдаления,
	|	ВложенияЭлектронныхПисем.Предопределенный,
	|	ВложенияЭлектронныхПисем.Наименование,
	|	ВложенияЭлектронныхПисем.Объект,
	|	ВложенияЭлектронныхПисем.ИмяФайла,
	|	ВложенияЭлектронныхПисем.Хранилище,
	|	ВложенияЭлектронныхПисем.ИДФайлаПочтовогоПисьма,
	|	ВложенияЭлектронныхПисем.Предмет,
	|	ВложенияЭлектронныхПисем.ТекстФайла,
	|	ВложенияЭлектронныхПисем.Представление
	|ИЗ
	|	Справочник.ВложенияЭлектронныхПисем КАК ВложенияЭлектронныхПисем
	|ГДЕ
	|	ВложенияЭлектронныхПисем.Объект = &Письмо");
	ЗапросПоВложениям.УстановитьПараметр("Письмо", Письмо);
    Возврат ЗапросПоВложениям.Выполнить().Выбрать();
КонецФункции	

Процедура ОсновныеДействияФормыЧерезLotus(Кнопка)
	Режим = РежимДиалогаВопрос.ДаНет;
	Ответ = Вопрос("Отправить помеченные письма?", Режим, 0);
	Если Ответ = КодВозвратаДиалога.Нет Тогда
	    Возврат;
	КонецЕсли;
	ЕстьПисьмаДляОтправки=Ложь;
	Письма = Новый Соответствие;
	МассивСтрок = Новый Массив;
	
	ИмяВременногоФайлаОбработки = КаталогВременныхФайлов() + "LotusNotes.epf";
	ДвоичныеДанные = ПолучитьМакет("LotusNotes");
	ДвоичныеДанные.Записать(ИмяВременногоФайлаОбработки);
	ПочтаLotus = ВнешниеОбработки.Создать(ИмяВременногоФайлаОбработки);
	ОсновнаяФормаLotus = ПочтаLotus.ПолучитьФорму();
	
	//ПочтаLotus = Обработки.LotusNotes.Создать();
	//ОсновнаяФормаLotus = ПочтаLotus.ПолучитьФорму();
	
	Для каждого СтрокаТабл Из ТаблицаСотрудников Цикл
		Если СтрокаТабл.Пометка и не СтрокаТабл.Письмо.Пустая() и СтрокаТабл.Письмо.СтатусПисьма <> Перечисления.СтатусыПисем.Отправленное Тогда
			//СтрокаТабл.Письмо.ПолучитьОбъект().ОтправитьПисьмо();
			Письма.Вставить(СтрокаТабл.Письмо, СтрокаТабл.Письмо.ПолучитьОбъект());
			МассивСтрок.Добавить(СтрокаТабл);
			Если не ЕстьПисьмаДляОтправки Тогда
				ЕстьПисьмаДляОтправки=Истина;
				УчетныеЗаписи = Новый Массив;
				УчетныеЗаписи.Добавить(СтрокаТабл.Письмо.УчетнаяЗапись);
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла; 
	Если ЕстьПисьмаДляОтправки Тогда
		//УправлениеЭлектроннойПочтой.ПолучениеОтправкаПисем(глЗначениеПеременной("глСоответствиеТекстовЭлектронныхПисем"), глЗначениеПеременной("глТекущийПользователь"), УчетныеЗаписи, Письма, Истина);
		Для каждого СтрокаТабл Из МассивСтрок Цикл
			
			ПочтаLotus.Subject = СтрокаТабл.Письмо.Тема;
			ПочтаLotus.Text = СтрокаТабл.Письмо.ТекстПисьма;
			ПочтаLotus.Too = СтрокаТабл.Адрес;
			
			Попытка
				Вложения = ПолучитьВложения(СтрокаТабл.Письмо);
				Если Вложения.Следующий() Тогда
  		  	 		ИмяВременногоФайла = КаталогВременныхФайлов() + Вложения.ИмяФайла;
					ДвоичныеДанные = Вложения.Хранилище.Получить();
					ДвоичныеДанные.Записать(ИмяВременногоФайла);
					ПочтаLotus.File = ИмяВременногоФайла;
				КонецЕсли;
			ОсновнаяФормаLotus.Отправить(Неопределено);
			УдалитьФайлы(ИмяВременногоФайла);
			УдалитьФайлы(ИмяВременногоФайлаОбработки);
			Исключение
				УдалитьФайлы(ИмяВременногоФайла);
				УдалитьФайлы(ИмяВременногоФайлаОбработки);
				Сообщить("При попытке отправить письмо произошла ошибка! " + ОписаниеОшибки());
				Продолжить;
			КонецПопытки;	
					
			//СтрокаТабл.Письмо.СтатусПисьма = Перечисления.СтатусыПисем.Отправленное;
			СамоПисьмо = СтрокаТабл.Письмо.ПолучитьОбъект();
			СамоПисьмо.СтатусПисьма = Перечисления.СтатусыПисем.Отправленное; 
			СамоПисьмо.Комментарий = "Отправлено через Lotus";
			СамоПисьмо.ДатаОтправления = ТекущаяДата();
			СамоПисьмо.ДатаТранспорта = ТекущаяДата();
			СамоПисьмо.Записать();
			СтрокаТабл.Пометка=Ложь;
		КонецЦикла; 	
	Иначе
		Предупреждение("Нет писем для отправки!");
	КонецЕсли; 
КонецПроцедуры
